Extensions/ИнтеграцияGreenApi/DataProcessors/iga_ChatBot.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>iga_ChatBot</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>IdInstance</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ApiToken</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>webhookUrl</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалОтправкиСообщений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтмечатьВходящиеСообщенияПрочитанными</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучатьВходящиеСообщенияИФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучатьВходящиеУведомления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучатьСтатусыОтправленныхСообщений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучатьУведомленииОСостоянииТелефона</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучатьУведомленияОСостоянииАккаунта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>apiUrl</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>mediaUrl</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыставлитьСтатусВСети</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательВебХука</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольВебХука</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортВебХука</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Enums/iga_ТипыМедиаФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>iga_ТипыМедиаФайлов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Картинка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аудио</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Видео</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГолосовоеСообщение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/DataProcessors/iga_ChatBot/Forms/ПросмотрМедиа/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Получаем параметры
	ИмяФайла = Параметры.ИмяФайла;
	Адрес    = Параметры.АдресМедиа;
	ТипМедиа = Параметры.ТипМедиа;
	
	// Получаем двоичные данные из хранилища
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
	
	// Определяем расширение и Mime-тип
	ПозТочки = СтрНайти(ИмяФайла, ".", НаправлениеПоиска.СКонца);
	Расширение = ?(ПозТочки > 0, НРег(Сред(ИмяФайла, ПозТочки + 1)), "");
	
	ВсеТипы = iga_ОбщегоНазначенияКлиентСервер.СоответствиеMimeTypes();
	MimeТип = ВсеТипы.Получить("." + Расширение);
	MimeТип = ?(MimeТип = Неопределено, "application/octet-stream", MimeТип);
	
	// ЛОГИКА ОПРЕДЕЛЕНИЯ СПОСОБА ОТОБРАЖЕНИЯ
	// Картинки выводим через Base64 (они обычно легкие)
	// Видео и Аудио — через файл, чтобы не перегружать память платформы
	
	Если ТипМедиа = ПредопределенноеЗначение("Перечисление.iga_ТипыМедиаФайлов.Картинка") Тогда
		
		Base64 = Base64Строка(ДвоичныеДанные);
		Base64 = СтрЗаменить(СтрЗаменить(Base64, Символы.ПС, ""), Символы.ВК, "");
		
		HTML = "<html><body style='margin:0; background:#222; display:flex; align-items:center; min-height:100vh;'>";
		HTML = HTML + "<img src='data:" + MimeТип + ";base64," + Base64 + "' style='width:100%; height:auto; display:block;'>";
		HTML = HTML + "</body></html>";
		
		ПолеHTML = HTML; // ТекстHTMLМедиа — это реквизит формы (Строка), связанный с ПолемHTML
		
	Иначе
		// Для видео и аудио подготавливаем данные для сохранения на клиенте
		// Саму генерацию HTML переносим на клиент (в ПриОткрытии)
		ПараметрыДляКлиента = Новый Структура;
		ПараметрыДляКлиента.Вставить("Адрес",     Адрес);
		ПараметрыДляКлиента.Вставить("Расширение", Расширение);
		ПараметрыДляКлиента.Вставить("MimeТип",   MimeТип);
		ПараметрыДляКлиента.Вставить("ТипМедиа",  ТипМедиа);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Асинх Процедура ПриОткрытии(Отказ) // Добавили ключевое слово Асинх
	
	Если ПараметрыДляКлиента = Неопределено Тогда
		Возврат; 
	КонецЕсли;
	
	// 1. Получаем каталог временных файлов асинхронно
	// Вместо синхронного метода используем Асинх-версию с ключевым словом Ждать
	КаталогВременных = Ждать КаталогВременныхФайловАсинх(); 
	
	ЧистоеИмя = "temp_media_" + Формат(ТекущаяДата(), "ДФ=HHmmss") + "." + ПараметрыДляКлиента.Расширение;
	
	// Используем нашу функцию объединения путей
	ПутьКФайлу = iga_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(КаталогВременных, ЧистоеИмя);
	
	// 2. Получаем данные и записываем их тоже асинхронно
	Данные = ПолучитьИзВременногоХранилища(ПараметрыДляКлиента.Адрес);
	
	// Метод Записать() заменяем на ЗаписатьАсинх()
	Ждать Данные.ЗаписатьАсинх(ПутьКФайлу); 
	
	// 3. Формируем путь для HTML
	URLФайла = "file:///" + СтрЗаменить(ПутьКФайлу, "\", "/");
	
	// Сборка HTML (без изменений)
	
	// В начале сборки переменной HTML добавьте скрипт:
	// Измененный стиль: width: 100% и убрали overflow:hidden у body
	HTML = "<html><head><script>
	|function stopMedia() {
	|    var media = document.getElementsByTagName('video')[0] || document.getElementsByTagName('audio')[0];
	|    if (media) {
	|        media.pause();
	|        media.src = '';
	|        media.load();
	|        media.remove();
	|    }
	|    document.body.innerHTML = '';
	|}
	|</script></head>";

	// У body ставим overflow-x:hidden, чтобы не было горизонтальной прокрутки
	HTML = HTML + "<body style='margin:0; background:#222; display:flex; align-items:center; min-height:100vh; overflow-x:hidden;'>";

	Если ПараметрыДляКлиента.ТипМедиа = ПредопределенноеЗначение("Перечисление.iga_ТипыМедиаФайлов.Видео") Тогда
	    // Видео на всю ширину
	    HTML = HTML + "<video controls autoplay style='width:100%; height:auto; display:block;'>";
	    HTML = HTML + "<source src='" + URLФайла + "' type='" + ПараметрыДляКлиента.MimeТип + "'>";
	    HTML = HTML + "</video>";
	    
	ИначеЕсли ПараметрыДляКлиента.ТипМедиа = ПредопределенноеЗначение("Перечисление.iga_ТипыМедиаФайлов.Аудио") Тогда
	    // Аудио обычно лучше оставить центрированным, так как растягивать полоску плеере на 100% ширины некрасиво
	    HTML = HTML + "<div style='width:100%; text-align:center; color:white; font-family:sans-serif;'>";
	    HTML = HTML + "<h3>Голосовое сообщение</h3>";
	    HTML = HTML + "<audio controls autoplay style='width:80%;'>";
	    HTML = HTML + "<source src='" + URLФайла + "' type='" + ПараметрыДляКлиента.MimeТип + "'>";
	    HTML = HTML + "</audio></div>";
	КонецЕсли;

	HTML = HTML + "</body></html>";
	
	ПолеHTML = HTML;

КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
    
    // 1. Вызываем JavaScript функцию для остановки плеера
    Попытка
		Если Не ПараметрыДляКлиента = Неопределено Тогда
			Элементы.ПолеHTML.Документ.defaultView.stopMedia();
		КонецЕсли;
	Исключение
        // Игнорируем, если скрипт не успел загрузиться
    КонецПопытки;
    
    // 2. Дополнительно обнуляем сам реквизит, чтобы спровоцировать очистку в 1С
    ТекстHTMLМедиа = "<html><body></body></html>";
	
	Если ЗначениеЗаполнено(ПутьКФайлу) Тогда
		УдалитьФайлыАсинх(ПутьКФайлу);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Асинх Процедура ОткрытьВПриложении(Команда)
	
	ЗапуститьПриложениеАсинх(ПутьКФайлу);
	
КонецПроцедуры
